# 1.
# 	1부터 100까지 출력 
# 1
# 2
# 3
# 4
# ..
# 99
# 100
for i in range(1,101):
    print(i)

# 2.
print('------------------------------------')
# 11111
# 22222
# 33333
# 44444
# 55555

for i in range(1, 6):
    print(str(i)*5)

# 3
print('------------------------------------')
# 99999
# 88888
# 77777
# 66666
# 55555

for i in range(9, 4, -1):
    print(str(i)*5)

# 4.  이중for문 사용 
print('------------------------------------')
# 1234
# 5678
x = 1
for j in range(2):
    word = ''
    for i in range(x, x+4):
        word += str(i)
        x = i
    print(word)


# 5. 
print('------------------------------------')

# 구구단8단 출력 
for i in range(1,10):
    print("8 *",i,"=",8*i)

# 6.
print('------------------------------------')

# 2단부터 9단까지 출력 

for j in range(2,10):
    for i in range(1,10):
        print(j,"*",i,"=",j*i)
    print('----------')

# 7.  구구단 3단 출력 
print('------------------------------------')
# 3   * 1 =  3   3 * 2 = 6   3 * 3 = 9 ...    3  * 9  = 27
for i in range(1,10):
    print("3 *", i, "=", 3*i, end=" ")
print()


# 8. 
print('------------------------------------')
# 1
# 11
# 111
# 1111
# 11111
for i in range(1,6):
    print("1"*i)

# 9 
print('------------------------------------')
# 	1
# 	2
# 	...
# 	...
# 	100
for i in range(1,101):
    print(i)

# 10  1부터 100 합계를 출력
print('------------------------------------')
# 	5050
sum = 0
for i in range(1, 101):
    sum += i
print(sum)


# 11
print('------------------------------------')
# 	*
# 	**
# 	***
# 	****
# 	*****
for i in range(1, 6):
    print("*"*i)


# 12
print('------------------------------------')
# 	1
# 	12
# 	123
# 	1234
# 	12345

ans = ""
for i in range(1, 6):
    ans += str(i)
    print(ans)


# 13. 
print('------------------------------------')
# 	2 * 1 = 2   2 * 2 = 4 ... 2 * 9 = 18
# 	3 * 1 = 3   3 * 2 = 6 ... 3 * 9 = 27
# 	...			   ...
# 	9 * 1 = 9   9 * 2 = 18 ... 9 * 9 = 81

for dan in range(2, 10):
    for i in range(2, 10):
        print(dan, "*", i, "=", dan*i, end=" ")
    print()

# 14. 
print('------------------------------------')
# 	*****
# 	****
# 	***
# 	**
# 	*	

for i in range(5, 0, -1):
    print("*"*i)

# 15.
print('------------------------------------')
# 	time Converter 

# 	시간입력:90061

# 	1일 1시간 1분 1초 입니다.	
time = int(input("시간입력 : "))
li = [[60, '초'], [60, '분'], [24,'시간']]
word = "입니다."
for i in li:
    word = str(time%i[0]) + i[1] + " " + word;
    time = time//i[0]
word = str(time) + "일 " + word;
print(word)

# 16.
print('------------------------------------')
# 	잔돈교환기(큰 단위 화폐순으로 ) 

# 	입력 : 67921 

# 	50000권 : 1매
# 	10000권 : 1매
# 	5000권  : 1매
# 	1000권  : 2매
# 	500권   : 1개
# 	100권   : 4개
# 	50권    : 0개
# 	10권    : 2개
# 	1원     : 1개 

li = [50000, 10000, 5000, 1000, 500, 100, 50, 10, 1]
money = int(input("돈을 넣어 주세요."))

for i in li:
    print(str(i) + "권\t:" + str(money//i) + "매")
    money = money%i





	






	




